// Modules (მოდულები) არის კოდის დამოუკიდებელი ბლოკები JavaScript-ში.
// ისინი გვეხმარება, რომ კოდი დავყოთ ნაწილებად, რაც ზრდის კოდის სტრუქტურას, გამჭვირვალობას და თავიდან გვარიდებს კოდის გამეორებას.

// ორი ძირითადი ოპერაცია მოდულებთან არის:
// 1. export – როცა ფაილიდან რაღაც ფუნქციას ან ცვლადს "ვგზავნით" გარეთ.
// 2. import – როცა სხვა ფაილიდან იმპორტს ვაკეთებთ (გამოგვაქვს) საჭირო ფუნქციები ან ცვლადები.

// მოდულების დახმარებით შეგვიძლია დავაწესოთ მჭიდრო ან სუსტი კავშირის ლოგიკას შორის და მარტივად ვმართოთ დიდი აპლიკაცია.
