let i = 1;

while(i <=10) {
    
    console.log(i)
    i ++;
}



// for loop:
// გამოიყენება მაშინ, როცა ციკლის განმეორების რაოდენობა წინასწარ ცნობილია.
// ციკლის ყველა ნაწილი (ინიციალიზაცია, პირობა, ცვლილება) ერთ ხაზშია ჩაწერილი.
// კოდი უფრო მოკლე და წაკითხვადია ორგანიზებულ შემთხვევებში.
// მაგალითად: რიცხვების ბეჭდვა 1-დან 10-მდე.

// while loop:
// გამოიყენება მაშინ, როცა ციკლის დასრულების პირობები წინასწარ უცნობია ან დამოკიდებულია რაღაც ლოგიკაზე.
// ციკლის კონტროლი ხდება გარედან — ცვლადის ინიციალიზაცია ციკლამდე და ცვლილება ციკლის შიგნით.
// მეტად მოქნილია, მაგრამ საჭიროებს მეტ ყურადღებას უსასრულო ციკლის თავიდან ასაცილებლად.
