let num = 11;

do {
  console.log("it will print at least one time");
} while (num <= 10);


// while loop:
// გამოიყენება მაშინ, როცა ციკლის დასრულების პირობები წინასწარ უცნობია ან დამოკიდებულია რაღაც ლოგიკაზე.
// ციკლის კონტროლი ხდება გარედან — ცვლადის ინიციალიზაცია ციკლამდე და ცვლილება ციკლის შიგნით.
// მეტად მოქნილია, მაგრამ საჭიროებს მეტ ყურადღებას უსასრულო ციკლის თავიდან ასაცილებლად.

// do...while loop:
// - ჯერ ასრულებს ციკლის შიგთავსს ერთხელ, შემდეგ ამოწმებს პირობას.
// - პირობის მნიშვნელობაზე დამოკიდებლად, ციკლი ყოველთვის შესრულდება მინიმუმ ერთხელ.
// - გამოიყენება მაშინ, როცა აუცილებელია ციკლი მაინც ერთხელ შესრულდეს (მაგ. მომხმარებლის შეყვანის მოთხოვნა).
