//npm ნიშნავს Node Package Manager-ს.

//ეს არის პაკეტების მენეჯერი Node.js ეკოსისტემისთვის.

//მას ვიყენებთ დამატებითი ბიბლიოთეკების/მოდულების დასაინსტალირებლად, მაგ. express, lodash, mongoose და სხვ.

//როცა ვაინსტალირებთ Node.js-ს ჩვენს კომპიუტერში, ავტომატურად გვაყენდება npm-იც.

//npm მოდის Node.js-თან ერთად.

//-------------------------------------------------------------------------------------

//package.json

//ეს არის ფაილი, რომელიც აღწერს Node.js პროექტს.

//მასში ინახება:

//პროექტის სახელი და ვერსია

//პროექტის ავტორი

//დამოკიდებულებები (dependencies) — რომელი ბიბლიოთეკები სჭირდება პროექტს

//სკრიპტები (scripts), მაგალითად npm start, npm test
