//React
//_____________
//React არის JavaScript ბიბლიოთეკა, რომელიც გამოიყენება ვებინტერფეისების (UI) შექმნისთვის. მთავარი იდეა: UI-ს დაყოფა მცირე, ხელმეორედ გამოყენებად კომპონენტებად, რაც კოდის მართვას და მასშტაბირებას გაგიადვილებს.

//კომპონენტი (Component)
//___________________________________________
//კომპონენტი არის UI-ის დამოუკიდებელი ნაწილი, რომელიც შეიძლება იყოს ფუნქციური ან კლასური. კომპონენტი იღებს props (პარამეტრებს) და შესაძლოა ჰქონდეს state (შიდა მდგომარეობა).

//JSX
//_____
//JSX (JavaScript XML) არის HTML-სმაგვარი სინტაქსი JavaScript-ში, რომელიც React-ში გამოიყენება UI ელემენტების შექმნისთვის. სინამდვილეში JSX JavaScript ფუნქციებად გადაიქცევა, რაც საშუალებას აძლევს React-ს ეფექტურად მართოს DOM.