/*ასინქრონიზაცია ნიშნავს, რომ პროგრამის გარკვეული ნაწილი არ აჩერებს დანარჩენ კოდს მისი დასრულების მოლოდინში.
ეს განსაკუთრებით საჭიროა ისეთ ოპერაციებში, რომლებიც დრო მოითხოვენ (მაგალითად: სერვერიდან მონაცემების წამოღება, ფაილის წაკითხვა, ტაიმერი)

Promise არის ობიექტი, რომელიც წარმოადგენს „დაპირებას“, რომ რაღაც ოპერაცია მომავალში დასრულდება (წარმატებით ან შეცდომით).
Promise-ს აქვს სამი მდგომარეობა: Pending,Fulfilled ,Rejected



მაგალითად:

დაპირება მზარეულისგან – „შეკვეთა მზად იქნება 30 წუთში“ → Promise Pending.

შეკვეთის მიღება – Promise Fulfilled.

შეკვეთის ჩაშლა/შეცდომა – Promise Rejected.

*/
