//ობიექტი არის მონაცემთა სტრუქტურა,  | რომელიც ატარებს ინფორმაციას წყვილებით: key (სახელი) და value (მნიშვნელობა). | მასივი კი არის მონაცემების სია, რომელიც ინახავს ელემენტებს ინდექსებით (0,1,2...) და არ აქვს კონკრეტული სახელები თითოეულზე. | ეს არის ჩემი ობიექტი სახელად me const Me = { firstname: "ნიკოლოზ, | სახელი lastname: "ლიჩელი", | გვარი age: 16, | ასაკი city: "თბილისი", | ქალაქი hobby: "კოდინგი" | დამატებითი კუთვნილება - ჰობი }; | ობიექტში კონკრეტული მონაცემი იძებნება მისი სახელით (მაგ: me.firstname) || მასივში კი ელემენტზე წვდომა ხდება ინდექსით (მაგ: array[0])
//ჩვენი ობიექტი const me = { firstname: "ნიკოლოზ", // სახელი lastname: "ლიჩელი", // გვარი age: 16, // ასაკი city: "თბილისი", // ქალაქი hobby: "კოდინგი" // ჰობი }; // ახლა დავამატოთ ახალი კუთვნილება me.pet = "ძაღლი"; // დავამატეთ ახალი კუთვნილება - შინაური ცხოველი // ახლა წავშალოთ ერთი კუთვნილება delete me.hobby; // მოვიშორეთ ჰობი // ჩავსვათ ჩაშენებული ობიექტი me.contacts = { email: "nika@example.com", // ელფოსტა phone: "555123456" // ტელეფონი }; // ახლა ჩვენს ობიექტს აქვს ჩაშენებული ობიექტიც (contacts)

let age = prompt("გთხოვ, შეიყვანე შენი ასაკი:");
age = Number(age);

if (age <= 13) {
  alert("თქვენ ხართ არასრულწლოვანი");
} else if (age > 13 && age <= 18) {
  alert("თქვენ ხართ თინეიჯერი");
} else if (age > 18) {
  alert("თქვენ ხართ ზრდასრული");
} else {
  alert("გთხოვთ, შეიყვანეთ ვალიდური ასაკი.");
}