#Lists (სიები) არის მონაცემთა სტრუქტურა, რომელიც გამოიყენება ელემენტების შესანახად. Python-ში სია მრავალფეროვანი ტიპის მონაცემებს ინახავს ერთ კონტეინერში, რაც პროგრამისტებს საშუალებას აძლევს მარტივად იმუშაონ მათთან.

#სიების მთავარი მახასიათებლები:

#მოწესრიგებული (Ordered): სიაში ელემენტებს აქვთ ფიქსირებული მიმდევრობა.

#ცვალებადი (Mutable): სიაში ელემენტების დამატება, წაშლა ან შეცვლა შესაძლებელია.

#ინდექსირებადი (Indexable): ელემენტებზე წვდომა შესაძლებელია მათი ინდექსის გამოყენებით.

#დუბლიკატების მხარდაჭერა (Duplicates Allowed): სიაში ერთი და იგივე მნიშვნელობა შეიძლება რამდენჯერმე იყოს წარმოდგენილი.




#2) ინდექსირება სიებში

#Python-ში სიაში ელემენტებზე წვდომა ხდება ინდექსის გამოყენებით. ინდექსები იწყება 0-დან და უარყოფითი ინდექსები ბოლო ელემენტიდან იწყება.
