function showNumber() {
  let number = 7;                         // ფუნქციის შიგნით
  console.log("ფუნქციის შიგნით:", number); 
}

showNumber();

console.log("ფუნქციის გარეთ:", number); //ეს კი გარეთ number is not defined

// GLOBAL SCOPE:
// ცვლადი გამოცხადებულია ფუნქციის ან ბლოკის გარეთ
// ხელმისაწვდომია სკრიპტის ყველა ნაწილში
// ფუნქციის შიგნითაც შესაძლებელია გლობალური ცვლადის წაკითხვა
// გლობალური ცვლადის შეცვლა ფუნქციის შიგნით ხდება მხოლოდ მაშინ, თუ მას თავიდან არ ვაცხადებთ let/const-ით
// გლობალური ცვლადები ინახება window ობიექტში (ბრაუზერში), თუ var ან უცხადებლად გამოცხადებულია

// LOCAL SCOPE:
// ცვლადი გამოცხადებულია ფუნქციის ან ბლოკის შიგნით (let, const ან var)
// ხელმისაწვდომია მხოლოდ იმ ფუნქციის ან ბლოკის შიგნით, სადაც გამოცხადდა
// გლობალური scope-ს გარეთ არსებული კოდი ვერ ხედავს ლოკალურ ცვლადს
// ერთსა და იმავე სახელით ლოკალური ცვლადი არ ცვლის გლობალურს — უბრალოდ "ფარავს" მას
// let და const ქმნიან ბლოკის scope-ს (მაგ. if, for შიგნით), var — მხოლოდ ფუნქციის scope-ს
